
print('{:^12}'.format('파이썬 쇼핑몰'))
print('{:<3}: {:<63}'.format('번호','1078718855')) # {:<3} 왼쪽 치우침 서식문자의 사용입니다.
print('{:<3}: {:<54}'.format('주소', '서울시 종로구 종로3가'))
print('{:<3}: {:<60}'.format('성명', '김사장'))
print('{:<3}: {:<63}'.format('전화', '070-1234-5678'))
print('{}'.format('-'*70))  # '-' 문자를 70번 반복하여 출력하는 표현입니다.
print('{:^23} {:^17} {:^12} {:^10}'.format('품명','단가','수량','금액'))  # 중앙정렬 서식문자의 사용입니다.
print('{}'.format('-'*70))
print('{:^18} {:>13,} {:>13,} {:>16,}'.format('블루투스 이어폰', 85000, 1, 85000)) # {:>16,} 오른쪽 치우침과 천단위 콤마적용의 서식문자의 사용입니다.
print('{:^25} {:>13,} {:>13,} {:>16,}'.format('USB3.0 8G', 8000, 1, 8000))
print('{}'.format('-'*70))
print('{:<13} {:>54,}'.format('소 계', 93000))   # 이 문장을 분석하세요
print('{}'.format('-'*70))
print('{:<11} {:>54,}'.format('청구금액', 93000))
print('{:<11} {:>54,}'.format('받은금액', 100000))
print('{:<11} {:>54,}'.format('거스름돈', 7000))
print('{}'.format('-'*70))









print("{:^10}" .format("*")) 
print("{:^10}" .format("*"*3)) 
print("{:^10}" .format("*"*5)) 
print("{:^10}" .format("*"*7)) 
print("{:^10}" .format("*"*5)) 
print("{:^10}" .format("*"*3)) 
print("{:^10}" .format("*"))